ams/src/Catalogs/КонтролируемыеПартии/КонтролируемыеПартии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтролируемыеПартии</name>
  <attributes>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПартияКонтроляКачества</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаБлокировкиТовара</name>
    <type>
      <types>CatalogRef.ПричиныБлокировкиТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланироватьРазблокировкуТовара</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодтвержденияКачества</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>DefinedType.ОтправительПолучательТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаПоступления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокументаПоступления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:Catalog>

ams/src/Catalogs/КонтролируемыеПартии/ManagerModule.bsl
#Если НЕ МобильныйАвтономныйСервер Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Наименование");
	Поля.Добавить("Договор");
	Поля.Добавить("ХозяйственнаяОперация");
	Поля.Добавить("НомерДокументаПоступления");
	Поля.Добавить("ДатаДокументаПоступления");
	Поля.Добавить("Партия");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = Данные.Наименование;
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		
		#Если Клиент Тогда
			ЭтоОсновнойЯзык = ОбщегоНазначенияУТКлиентПовтИсп.ЭтоОсновнойЯзык();
		#Иначе
			ЭтоОсновнойЯзык = ОбщегоНазначенияУТПовтИсп.ЭтоОсновнойЯзык();
		#КонецЕсли
		
		Если Не ЭтоОсновнойЯзык Тогда
			Представление = КонтрольКачестваКлиентСервер.ПредставлениеКонтролируемойПартии(Данные, ТекущийЯзык().КодЯзыка);
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
